from flask import Flask, request, jsonify,render_template
from flask_cors import CORS
from inference_sdk import InferenceHTTPClient
import tempfile
import os
from PIL import Image
import io

app = Flask(__name__)
CORS(app)

# โหลดโมเดล
CLIENT = InferenceHTTPClient(
    api_url=os.environ["ROBOFLOW_API_URL"],
    api_key=os.environ["ROBOFLOW_API_KEY"]
)

MODEL_ID = "project-tfamf/1"


# ข้อมูลโรค
disease_info = {
    "Acne": {
        "meaning":"สิว(Ance) โรคผิวหนังที่เกิดจากการอุดตันของรูขุมขนและต่อมไขมัน โดยมีสาเหตุหลักมาจากเซลล์ผิวที่ตายแล้วและไขมันส่วนเกินจับตัวกันจนเกิดเป็นตุ่มนูน มักพบบริเวณใบหน้า ลำคอ หน้าอก และแผ่นหลัง ซึ่งเป็นจุดที่มีต่อมไขมันหนาแน่น",
        "symptoms": ["ตุ่มแดง", "มีหนอง", "เจ็บปวดบริเวณตุ่ม","คันเล็กน้อย"],
        "advice": ["ล้างหน้าวันละ 2 ครั้ง", "หลีกเลี่ยงการบีบสิว", "หากอักเสบรุนแรงควรพบแพทย์"]
    },
    "Ringworm": {
        "meaning":"กลาก (Ringworm) คือโรคติดเชื้อราที่ผิวหนัง โดยเชื้อรากลุ่มเดอร์มาโตไฟต์ (Dermatophyte) ลักษณะเป็นผื่นแดงรูปวงกลมหรือวงรี ขอบนูนหนา มีสะเก็ดหรือขุย ตรงกลางวงมักมีสีผิวปกติ ",
        "symptoms": ["ผื่นวงกลม", "คัน", "ขอบแดง"],
        "advice": ["รักษาความสะอาด", "ใช้ยาต้านเชื้อรา", "หลีกเลี่ยงใช้ของร่วมกับผู้อื่น"]
    },
    "Urticaria Hives": {
        "meaning":"โรคลมพิษ(Urticaria)อาการทางผิวหนังที่แสดงออกเป็นผื่นหรือปื้นนูนแดง มีอาการคันอย่างรุนแรง เกิดจากร่างกายหลั่งสารฮิสตามีน (Histamine) ทำให้หลอดเลือดขยายตัว ",
        "symptoms": ["ผื่นนูนแดง", "คันมาก","กระจายตามร่างกาย", "ผื่นมักขึ้นไม่เกิน 24ชั่วโมงแต่ก็สามารถขึ้นใหม่ได้"],
        "advice": ["หลีกเลี่ยงสิ่งกระตุ้น", "รับประทานยาแก้แพ้ตามคำแนะนำแพทย์"]
    },
    "Vitiligo": {
        "meaning":"โรคด่างขาว(Vitiligo) เป็นโรคผิวหนังที่เกิดจากการสูญเสียเซลล์เม็ดสี ทำให้ผิวหนังเกิดเป็นปื้นสีขาว สามารถเกิดได้ทุกส่วนของร่างกาย",
        "symptoms": ["เริ่มจากจุดสีขาวเล็กๆค่อยๆขยายใหญ่ขึ้นบางรายอาจมีอาการคันและไวต่อแสงแดด"],
        "advice": ["ทาครีมกันแดด", "พบแพทย์ผิวหนัง"]
    },
    "Hyperpigmentation": {
        "meaning":"รอยดำ/ผิวคล้ำ(Hyperpigmentation)  เป็นโรคผิวหนังที่เกิดจากการสูญเสียเซลล์เม็ดสี ทำให้ผิวหนังเกิดเป็นปื้นสีขาว สามารถเกิดได้ทุกส่วนของร่างกาย สาเหตุหลัก: เกิดจากการที่เซลล์สร้างเม็ดสีถูกกระตุ้น ซึ่งมักมาจากรังสียูวีในแสงแดด การอักเสบหรือการบาดเจ็บของผิวหนัง การเปลี่ยนแปลงของฮอร์โมน และผลข้างเคียงจากยาบางชนิด",
        "symptoms": ["ผิวคล้ำ", "สีผิวไม่สม่ำเสมอ"],
        "advice": ["หลีกเลี่ยงแดด", "ใช้ครีมกันแดด"]
    },
    "Normal": {
        "meaning":"ผิวปกติ(์Normal) ไม่พบสภาวะผิดปกติใดๆ",
        "symptoms": ["ไม่พบความผิดปกติ"],
        "advice": ["ดูแลผิวตามปกติ", "ทาครีมกันแดด"]
    },
    "Nevus": {
        "meaning":"ไฝ(Nevus) การเจริญเติบโตของเซลล์สร้างเม็ดสีที่เรียกว่า เมลาโนไซต์ (Melanocytes) มารวมตัวกันเป็นกระจุกแทนที่จะกระจายตัวไปตามปกติ มักปรากฏเป็นจุดหรือตุ่มสีน้ำตาล สีดำ หรือสีเนื้อ",
        "symptoms": ["ไฝ", "จุดสีน้ำตาล"],
        "advice": ["สังเกตการเปลี่ยนแปลงของไฝ", "หากผิดปกติควรพบแพทย์"]
    },
    "Nail_psoriasis": {
        "meaning":"สะเก็ดเงินที่เล็บ(Nail psoriasis) ภาวะที่โรคสะเก็ดเงินแสดงอาการบริเวณเล็บมือหรือเล็บเท้า เกิดจากระบบภูมิคุ้มกันทำงานผิดปกติ ส่งผลให้เซลล์ผิวหนังและบริเวณใต้โคนเล็บแบ่งตัวเร็วกว่าปกติ ทำให้เล็บมีลักษณะหนา เปราะ เป็นหลุม ร่อน และเปลี่ยนสี",
        "symptoms": ["เล็บหนา", "เล็บเป็นหลุม"],
        "advice": ["ดูแลเล็บให้สะอาด", "พบแพทย์ผิวหนัง"]
    },
     "Athlete foot": {
        "meaning":"น้ำกัดเท้า(Athlete's foot) โรคติดเชื้อราที่ผิวหนังบริเวณเท้า มักเกิดในบริเวณซอกนิ้วเท้า โดยเชื้อราชนิดนี้เติบโตได้ดีในสภาพแวดล้อมที่เปียกชื้นและอับอากาศ",
        "symptoms": ["คัน", "แสบร้อน","ผิวหนังบริเวณซอกนิ้วเท้ารวมถึงฝ่าเท้าลอก เป็นขุย หรือแตกเป็นแผล","รอยเปื่อยสีขาว","กลิ่นเท้าไม่พึงประสงค์"],
        "advice": ["ล้างเท้าให้สะอาด", "ซับให้แห้งสนิทโดยเฉพาะซอกเท้า","ทายาต้านเชื้อรา","เลือกใส่รองเท้าที่โปร่ง"]
    },
    "Cellulitis": {
        "meaning":"เนื้อเยื่ออักเสบ(Athlete's foot) การติดเชื้อแบคทีเรียที่ผิวหนังและเนื้อเยื่อใต้ผิวหนัง มักเกิดขึ้นบริเวณขาหรือส่วนอื่นๆ ของร่างกาย โดยแบคทีเรียจะเข้าสู่ร่างกายผ่านทางบาดแผล รอยถลอก หรือผิวหนังที่แห้งแตก",
        "symptoms": ["ปวด เจ็บเมื่อสัมผัส", "แสบร้อน","บวม","ผิวแดงร้อน","ผิวหนังอาจมีลักษณะขรุขระคล้ายเปลือกส้ม","มีตุ่มน้ำพุพอง","มักพบที่ขาข้างเดียว","ผู้ป่วยอาจมีไข้หรือต่อมน้ำเหลืองโต"],
        "advice": ["ทานยาให้ครบตามที่แพทย์สั่ง", "ดูแลตนเองโดยยกอวัยวะที่ติดเชื้อให้สูงเพื่อลดบวม","ห้ามบีบหรือเจาะแผลเอง"]
    },
    "Chickenpox": {
        "meaning":"อีสุกอีใส(Chickenpox) การติดเชื้อแบคทีเรียที่ผิวหนังและเนื้อเยื่อใต้ผิวหนัง มักเกิดขึ้นบริเวณขาหรือส่วนอื่นๆ ของร่างกาย โดยแบคทีเรียจะเข้าสู่ร่างกายผ่านทางบาดแผล รอยถลอก หรือผิวหนังที่แห้งแตก",
        "symptoms": ["เริ่มจากไข้ต่ำ", "ปวดเมื่อย","เบื่ออาหาร","ตามมาด้วยผื่นแดงที่กลายเป็นตุ่มน้ำใสคันทั่วร่างกาย","ก่อนจะตกสะเก็ดและหายไปเองภายใน 7-10 วัน"],
        "advice": ["พักผ่อนให้เพียงพอ", "ทานยาลดไข้ (หลีกเลี่ยงแอสไพริน)","ห้ามแคะหรือเกาตุ่ม"]
    },
    "Cutaneous larva migrans": {
        "meaning":"โรคพยาธิไชผิวหนัง(Cutaneous larva migrans) เป็นโรคผิวหนังที่เกิดจากการที่ตัวอ่อนพยาธิปากขอของสัตว์ (เช่น สุนัขและแมว) ไชผ่านผิวหนังของมนุษย์",
        "symptoms":["ผื่นนูนแดงเป็นเส้นคดเคี้ยว", "เคลื่อนย้ายตำแหน่งได้","คันอย่างรุนแรง โดยเฉพาะเวลากลางคืน","มักพบบริเวณฝ่าเท้า ง่ามนิ้วเท้า ก้น และมือ ที่สัมผัสดินทรายปนเปื้อน"],
        "advice": ["ควรพบแพทย์"]
    },
     "Eczema": {
        "meaning":"Eczema กลุ่มโรคผิวหนังอักเสบเรื้อรังที่ทำให้ผิวแห้ง แดง บวม และมีอาการคันอย่างรุนแรง พบได้ทุกเพศทุกวัย มักเกิดจากหลายปัจจัยร่วมกันโรคนี้ไม่ติดต่อและไม่สามารถรักษาให้หายขาดได้ แต่สามารถควบคุมอาการให้สงบลงได้",
        "symptoms":["ผิวแห้ง", "แดง","คันอย่างรุนแรง","มักพบบริเวณใบหน้า ข้อศอก และหลังหัวเข่า","ผื่นอาจมีตุ่มน้ำใส ตกสะเก็ด หรือมีน้ำเหลืองซึม "],
        "advice": ["ทาครีมบำรุงผิว","อาบน้ำด้วยน้ำอุ่นหรือน้ำอุณหภูมิปกติ","หลีกเลี่ยงสบู่อาบน้ำทั่วไปที่รุนแรง","งดการแคะแกะเกา","หากมีผื่นแดงอักเสบ ควรใช้ยาสเตียรอยด์ชนิดทาบางๆ ตามคำแนะนำของแพทย์อย่างเคร่งครัด",]
    },
     "Eczema": {
        "meaning":"Eczema กลุ่มโรคผิวหนังอักเสบเรื้อรังที่ทำให้ผิวแห้ง แดง บวม และมีอาการคันอย่างรุนแรง พบได้ทุกเพศทุกวัย มักเกิดจากหลายปัจจัยร่วมกันโรคนี้ไม่ติดต่อและไม่สามารถรักษาให้หายขาดได้ แต่สามารถควบคุมอาการให้สงบลงได้",
        "symptoms":["ผิวแห้ง", "แดง","คันอย่างรุนแรง","มักพบบริเวณใบหน้า ข้อศอก และหลังหัวเข่า","ผื่นอาจมีตุ่มน้ำใส ตกสะเก็ด หรือมีน้ำเหลืองซึม "],
        "advice": ["ทาครีมบำรุงผิว","อาบน้ำด้วยน้ำอุ่นหรือน้ำอุณหภูมิปกติ","หลีกเลี่ยงสบู่อาบน้ำทั่วไปที่รุนแรง","งดการแคะแกะเกา","หากมีผื่นแดงอักเสบ ควรใช้ยาสเตียรอยด์ชนิดทาบางๆ ตามคำแนะนำของแพทย์อย่างเคร่งครัด",]
    },
     "HFMD": {
        "meaning":"โรคมือเท้าปาก(HFMD) เป็นโรคติดต่อที่เกิดจากการติดเชื้อไวรัสกลุ่มเอนเทอโรไวรัส พบได้บ่อยมากในกลุ่มเด็กทารกและเด็กเล็ก ติดต่อผ่านการสัมผัสสารคัดหลั่ง เช่น น้ำลาย น้ำมูก อุจจาระ หรือใช้ของเล่นร่วมกัน",
        "symptoms":["ไข้สูง", "เจ็บคอ","เบื่ออาหาร","หลังจากนั้น 1-2 วัน จะพบแผลเปื่อยพุพองในปาก ","มีผื่นแดงหรือตุ่มน้ำใสขึ้นบริเวณฝ่ามือ ฝ่าเท้า และบางครั้งอาจพบบนก้นหรืออวัยวะเพศ ","มักหายได้เองภายใน 7-10 วัน"],
        "advice": ["พักผ่อนให้เพียงพอ","ดื่มน้ำมากๆ เพื่อป้องกันภาวะขาดน้ำ ","ทานอาหารอ่อน","งดการแคะแกะเกา","หลีกเลี่ยงของร้อนจัดหรือมีรสเปรี้ยว/เผ็ด เพื่อลดความเจ็บปวดจากแผลในปาก",]
    },
    "Hordeolum": {
        "meaning":"โรคตากุ้งยิง(Hordeolum) เกิดจากการติดเชื้อแบคทีเรีย ทำให้ต่อมไขมันหรือต่อมเหงื่อบริเวณเปลือกตาอุดตันและกลายเป็นตุ่มนูนบวมแดง",
        "symptoms":["คัน ระคายเคืองตา", "ตามมาด้วยตุ่มนูนบวมแดงบริเวณขอบเปลือกตาหรือใต้เปลือกตาซึ่งจะเจ็บปวดมาก","ตาแดง น้ำตาไหล สู้แสงไม่ได้ ","รู้สึกเหมือนมีสิ่งแปลกปลอมอยู่ในตา ","เมื่อเวลาผ่านไปจะเกิดเป็นหัวหนองสีเหลืองคล้ายสิว"],
        "advice": ["ประคบอุ่นด้วยผ้าสะอาดครั้งละ 10-15 นาที วันละ 3-4 ครั้ง เพื่อช่วยระบายหนอง","ควรใช้ยาหยอดหรือป้ายตาตามที่แพทย์หรือเภสัชกรแนะนำ  ","ห้ามบีบหรือเจาะหัวสิวด้วยตนเองเด็ดขาด","งดใส่คอนแทคเลนส์",]
    },
    "Longitudinal nail pigmentation": {
        "meaning":"Longitudinal nail pigmentation ภาวะที่เล็บมีแถบสีน้ำตาลหรือสีดำเข้มพาดตามแนวยาวของเล็บ (จากโคนเล็บไปจนถึงปลายเล็บ) ซึ่งเกิดจากการทำงานที่มากขึ้นของเซลล์สร้างเม็ดสี (Melanocytes) ทำให้มีการสะสมของเม็ดสีเมลานินในเนื้อเล็บมากกว่าปกติ",
        "symptoms":["เล็บมีเส้นสีน้ำตาลหรือสีดำพาดตามแนวตั้งจากโคนเล็บไปจนถึงปลายเล็บ"],
        "advice": ["พบแพทย์ผิวหนังเพื่อประเมินรอยโรคด้วยเครื่องมือเฉพาะ (Dermoscopy) เนื่องจากอาจเป็นสัญญานเตือนของมะเร็งผิวหนังชนิดเมลาโนมา",]
    },
    "Nail fungus": {
        "meaning":"เชื้อราที่เล็บ(Nail fungus) การติดเชื้อราที่เกิดขึ้นบริเวณเล็บมือหรือเล็บเท้า (มักพบบ่อยที่เล็บเท้า) ทำให้เล็บมีลักษณะหนาตัวขึ้น เปลี่ยนสี (เป็นสีขาว เหลือง หรือน้ำตาล) เปราะบาง แตกหักง่าย หรือหลุดลอกออกจากฐานเล็บ",
        "symptoms":["เล็บเปลี่ยนสี", "เล็บหนาตัวขึ้น","เปราะบางแตกหักง่าย ","ผิวเล็บไม่เรียบเนียน","เล็บอาจบิดเบี้ยว ","มีกลิ่นเหม็น","รอบเล็บอาจมีการบวมแดง "],
        "advice": ["รักษาความสะอาด ","ตัดเล็บให้สั้น","ปรึกษาแพทย์",]
    },
       "Scabies": {
        "meaning":"โรคหิด(Scabies) โรคผิวหนังที่เกิดจากการติดเชื้อไรตัวเล็กๆ ชื่อว่า Sarcoptes scabiei ซึ่งชอนไชและวางไข่ใต้ผิวหนัง ติดต่อได้ง่ายผ่านการสัมผัสใกล้ชิดหรือใช้ของใช้ร่วมกัน",
        "symptoms":["คันรุนแรงเฉพาะตอนกลางคืน", "ผื่นแดง","ตุ่มน้ำใส หรือร่องรอยการชอนไชเป็นเส้นสีเงินคดเคี้ยว ","ปรากฏตามบริเวณรอยพับ เช่น ง่ามนิ้วมือ ข้อมือ ข้อศอก รักแร้ รอบสะดือ และอวัยวะเพศ"],
        "advice": ["ทายาให้ถูกวิธี ","รักษาความสะอาด"]
    },  
     "Shingles": {
        "meaning":"โรคงูสวัด(Shingles)  คือโรคที่เกิดจากการติดเชื้อไวรัส Varicella Zoster Virus (VZV) ซึ่งเป็นไวรัสชนิดเดียวกับโรคอีสุกอีใส",
        "symptoms":["เริ่มต้นด้วยอาการปวดแสบปวดร้อน คัน", "ชาบริเวณผิวหนังซีกใดซีกหนึ่งของร่างกาย","หลังจากนั้น 1-3 วัน จะมีผื่นแดงและกลายเป็นกลุ่มตุ่มน้ำใสขึ้นตามแนวเส้นประสาท ซึ่งมักจะเรียงตัวเป็นแนวยาว ","อาจมีไข้หรือปวดศีรษะร่วมด้วย"],
        "advice": ["ควรรีบพบแพทย์เพื่อรับยาต้านไวรัสภายใน 48-72 ชั่วโมง นับตั้งแต่เริ่มมีอาการปวดหรือมีผื่นขึ้น"]
    },  
    "SJS-TEN": {
        "meaning":"SJS-TEN  กลุ่มอาการแพ้ยาชนิดรุนแรงมาก ซึ่งจัดอยู่ในโรคกลุ่มเดียวกัน โดย SJS (Stevens-Johnson Syndrome) มีพื้นที่ผิวหนังหลุดลอกน้อยกว่า 10% และ TEN (Toxic Epidermal Necrolysis) มีความรุนแรงขั้นสุดโดยผิวหนังหลุดลอกมากกว่า 30% จัดเป็นภาวะฉุกเฉินที่อันตรายถึงชีวิต",
        "symptoms":["ไข้สูง", "ปวดเมื่อยคล้ายไข้หวัด ","จากนั้นจะมีผื่นแดงหรือม่วงคล้ำลุกลาม","เกิดตุ่มพอง และผิวหนังหลุดลอกคล้ายแผลไฟไหม้ โดยเฉพาะบริเวณเยื่อบุช่องปากและดวงตา"],
        "advice": ["ให้หยุดใช้ยาทุกชนิดที่สงสัยว่าเป็นสาเหตุทันที และรีบไปพบแพทย์ที่ห้องฉุกเฉินใกล้บ้านเพื่อเข้ารับการรักษาตัวในโรงพยาบาล"]
    },   
}

@app.route("/")
def home():
    return render_template("index.html")

@app.route("/predict", methods=["POST"])
def predict():

    if "image" not in request.files:
        return jsonify({"error": "No image uploaded"}), 400

    file = request.files["image"]

    with tempfile.NamedTemporaryFile(delete=False, suffix=".jpg") as tmp:
        file.save(tmp.name)
        temp_path = tmp.name

    result = CLIENT.infer(
        temp_path,
        model_id=MODEL_ID
    )
    print(result)
    


    os.remove(temp_path)

    predictions = []

    for item in result["predictions"]:
        predictions.append({
            "disease": item["class"],
            "confidence": round(item["confidence"] * 100, 2)
        })

    predictions.sort(key=lambda x: x["confidence"], reverse=True)

    best = predictions[0]

    disease = best["disease"]
    confidence = best["confidence"]

    info = disease_info.get(
        disease,
        {
            "meaning": "ยังไม่มีข้อมูล",
            "symptoms": ["ไม่มีข้อมูล"],
            "advice": ["ควรปรึกษาแพทย์"]
        }
    )

    return jsonify({
        "disease": disease,
        "confidence": confidence,
        "predictions": predictions[:5],
        "symptoms": info["symptoms"],
        "advice": info["advice"],
        "meaning": info["meaning"]
    })
import os

if __name__ == "__main__":
    port = int(os.environ.get("PORT",5000))
    app.run(host="0.0.0.0", port=5000, debug=True)
